## Introduction to Pandas library

Pandas library has the purpose of complementing numPy's `ndarrays`, using multidimensional arrays as `DataFrames` 

```python
   import pandas as pd
   pd.__version__
```

In [2]:
import pandas as pd
pd.__version__

'0.25.2'

### Objects of pandas' library

**Series object** is a one-dimensioned array where data is indexed, and are created from lists.

In [3]:
data = pd.Series([0.25, 0.50, 0.75, 1.0 ])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In the previous output, we can see that each Series item has a value and index.
`variable.values` `variable.index`

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
data[3]

1.0

In [8]:
data[1:2]

1    0.5
dtype: float64

You can set up your own indexes in your series, that don't need to be of the same type as your values.

In [12]:
data2 = pd.Series([0.25, 0.50, 0.75, 1.00], index = ["a","b","c","d"])
data2

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
data3 = pd.Series([0.25, 0.50, 0.75, 1], index =[2, 5, 3, 7])
data3

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [16]:
data2["b"]

0.5

In [18]:
data3[7]

1.0

Pandas' data is analogous to a dictionary, but more efficient with operation that require keys or indexes associated with values.
Next, we will build a Series object from a dictionary:

In [20]:
dic_population = {"São Paulo" :45919049,
                  "Minas Gerais": 2116879,
                 "Rio de Janeiro":17264943,
                 "Bahia":14873064,
                 "Paraná": 11433957}
population = pd.Series(dic_population)
population

São Paulo         45919049
Minas Gerais       2116879
Rio de Janeiro    17264943
Bahia             14873064
Paraná            11433957
dtype: int64

In [21]:
population["São Paulo"]

45919049

In [22]:
population["São Paulo":"Rio de Janeiro"]

São Paulo         45919049
Minas Gerais       2116879
Rio de Janeiro    17264943
dtype: int64

**Data Frame object** is an analogous of a two-dimensioned array with flexible lables for rows and columns.

In [23]:
dic_area = {"São Paulo": 248222, "Minas Gerais":586522 ,
            "Rio de Janeiro":43780, "Bahia": 564733,"Paraná":199307}
area=pd.Series(dic_area)
area

São Paulo         248222
Minas Gerais      586522
Rio de Janeiro     43780
Bahia             564733
Paraná            199307
dtype: int64

Creation of a `DataFrame` from two `Series`

In [24]:
states = pd.DataFrame({"Population":population, "Area":area})
states

                Population    Area
São Paulo         45919049  248222
Minas Gerais       2116879  586522
Rio de Janeiro    17264943   43780
Bahia             14873064  564733
Paraná            11433957  199307

Using data from your `Series`, the `DataFrame` has its' information indexed and easily accessed. 
  - row indexes: `name.index`
  - columns indexes:`name.column`

In [26]:
states.index

Index(['São Paulo', 'Minas Gerais', 'Rio de Janeiro', 'Bahia', 'Paraná'], dtype='object')

In [27]:
states.columns

Index(['Population', 'Area'], dtype='object')

You can access your columns' data separately :

In [28]:
states["Area"]

São Paulo         248222
Minas Gerais      586522
Rio de Janeiro     43780
Bahia             564733
Paraná            199307
Name: Area, dtype: int64

 Constructing a data frame from only one `Series`and from a dictionary list

In [31]:
pd.DataFrame(population, columns =["population"])

                population
São Paulo         45919049
Minas Gerais       2116879
Rio de Janeiro    17264943
Bahia             14873064
Paraná            11433957

In [33]:
data4 = [{"a": i, "b": 2*i}
        for i in range(10)]
pd.DataFrame(data4)

   a   b
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10
6  6  12
7  7  14
8  8  16
9  9  18

Creating Data Frames from an union of diffrent dictionaries: when not specified, an empty value will result on a `NaN (not a number)`

In [34]:
pd.DataFrame([{"a":1,"b":2},{"b": 3, "c":4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

Creating Data Frame from a numPy array:

In [36]:
import numpy as np

In [37]:
pd.DataFrame(np.random.rand(3,2),
            columns = ["Column 1", "Column 2 "],
            index = ["a", "b", "c"])

   Column 1  Column 2
a  0.691713   0.219515
b  0.210341   0.319263
c  0.075722   0.935428

**Index properties**

In [38]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [39]:
ind[3]

7

In [40]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [41]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

The `Index` type cannot have modifications within it's lists, unlike an array. It is very similar to Pythons' `set`s, so you can perform the same operations, like unions, intersections, etc; helping operation in DataFrame.

In [42]:
indA = pd.Index([1, 3,  5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [43]:
indA & indB #intersection

Int64Index([3, 5, 7], dtype='int64')

In [45]:
indA | indB #union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [46]:
indA ^ indB #Symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

In [47]:
indA.intersection(indB)

Int64Index([3, 5, 7], dtype='int64')

In [49]:
indA.union(indB)

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [50]:
indA.symmetric_difference(indB)

Int64Index([1, 2, 9, 11], dtype='int64')

### Indices manipulation and selection

Remembering creating the data2 dataframe:

```Python
 data2 = pd.Series([0.25, 0.50, 0.75, 1],
                  index=["a", "b","c","d"])
    ```

In [51]:
data2

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [53]:
"a" in data2

True

In [55]:
data2.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [56]:
list(data2.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [59]:
data2["e"] = 1.25
data2

a    0.25
b     0.5
c    0.75
d       1
e    1.25
dtype: object

In [60]:
data2["a":"c"]

a    0.25
b     0.5
c    0.75
dtype: object

In [62]:
data2[0:2]

a    0.25
b     0.5
dtype: object

In [63]:
#masking
data2[(data2>0.3)&(data2<0.8)]

b     0.5
c    0.75
dtype: object

In [65]:
#fancy indexing 
data2[["a","e"]]

a    0.25
e    1.25
dtype: object

In [66]:
data2.loc["a":"c"] #Locate using explicit indexes

a    0.25
b     0.5
c    0.75
dtype: object

In [68]:
data2.iloc[2:5] #LOcate using implicit indexes

c    0.75
d       1
e    1.25
dtype: object

In [69]:
states.Area

São Paulo         248222
Minas Gerais      586522
Rio de Janeiro     43780
Bahia             564733
Paraná            199307
Name: Area, dtype: int64

In [71]:
states["Density"] = states["Population"]/states["Area"]
states

                Population    Area     Density
São Paulo         45919049  248222  184.991858
Minas Gerais       2116879  586522    3.609206
Rio de Janeiro    17264943   43780  394.356852
Bahia             14873064  564733   26.336453
Paraná            11433957  199307   57.368567

In [73]:
#Transposition
states.T

,São Paulo,Minas Gerais,Rio de Janeiro,Bahia,Paraná
Population,4.591905e+07,2.116879e+06,1.726494e+07,1.487306e+07,1.143396e+07
Area,2.482220e+05,5.865220e+05,4.378000e+04,5.647330e+05,1.993070e+05
Density,1.849919e+02,3.609206e+00,3.943569e+02,2.633645e+01,5.736857e+01

In [77]:
states.iloc[: 3, : 2]

                Population    Area
São Paulo         45919049  248222
Minas Gerais       2116879  586522
Rio de Janeiro    17264943   43780

In [79]:
states.loc[:"Rio de Janeiro", :"Area"]

                Population    Area
São Paulo         45919049  248222
Minas Gerais       2116879  586522
Rio de Janeiro    17264943   43780

In [80]:
states.iloc[1, 2] = 36
states

                Population    Area     Density
São Paulo         45919049  248222  184.991858
Minas Gerais       2116879  586522   36.000000
Rio de Janeiro    17264943   43780  394.356852
Bahia             14873064  564733   26.336453
Paraná            11433957  199307   57.368567

### Panda methods of calculating operation

 |Python operator | Panda method |
 |----------------|--------------|
 | `+` | `add()`|
 |` -` |` subtract()`|
 |`*`  | `mul()` `multiply()`|
 |`/` | `truediv()` `div()` `divide()`|
 |`//` |`floordiv()`|
 |` %` |`mod()`|
 |`**` | `pow()`|

### Combinating Data Frames 
The ``pd.concat()`` function can be used for ``Series`` or ``DataFrame`` with the folowing parameters:

```python
pd.concat(<Objetos>, axis=0, join='outer', join_axes=None, ignore_index=False,
          keys=None, levels=None, names=None, verify_integrity=False,
          copy=True)
```

The standard concatenation occurs "row-wise", when the parameter `axis` = 0, changing it modifies your concatenation.

In [81]:
ser1 = pd.Series(['A','B','C'], index= [1,2,3])
ser2 = pd.Series(['D','E','F'], index = [4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [82]:
df1= pd.DataFrame({'A':['A1','A2'],'B':['B1','B2']})
df2= pd.DataFrame({'A':['A3', 'A4'], 'B':['B3','B4']})
pd.concat([df1,df2])

    A   B
0  A1  B1
1  A2  B2
0  A3  B3
1  A4  B4

In [83]:
pd.concat([df1,df2], axis=1)

    A   B   A   B
0  A1  B1  A3  B3
1  A2  B2  A4  B4

### Merging DataFrames

`pd.merge`

In [86]:
#one to one
df3 = pd.DataFrame({'Empregado':['Carlos','Luiz','Lívia','João'],
                    'Grupo':['Contabilidade', 'Engenharia','Engenharia','RH' ]})
df4 = pd.DataFrame({'Empregado':['Lívia', 'Carlos','Luiz','João'],
                    'Data_contratação':[2004,2008,2012,2014]})
df5 = pd.merge(df3,df4)
df5

  Empregado          Grupo  Data_contratação
0    Carlos  Contabilidade              2008
1      Luiz     Engenharia              2012
2     Lívia     Engenharia              2004
3      João             RH              2014

In [88]:
#Many to one
df6 = pd.DataFrame({'Grupo':['Contabilidade', 'Engenharia','RH'], 
                    'Supervisor':['Marcelo','Paulo','Helen']})
pd.merge(df5,df6)

  Empregado          Grupo  Data_contratação Supervisor
0    Carlos  Contabilidade              2008    Marcelo
1      Luiz     Engenharia              2012      Paulo
2     Lívia     Engenharia              2004      Paulo
3      João             RH              2014      Helen

In [90]:
#Many to many
df7 = pd.DataFrame({'Grupo': ['Contabilidade', 'Contabilidade',
                              'Engenharia', 'Engenharia', 'RH', 'RH'],
                    'Habilidades': ['matemática', 'planilhas', 'programação', 'linux',
                               'planilhas', 'linux']})
pd.merge(df3, df7)

  Empregado          Grupo  Habilidades
0    Carlos  Contabilidade   matemática
1    Carlos  Contabilidade    planilhas
2      Luiz     Engenharia  programação
3      Luiz     Engenharia        linux
4     Lívia     Engenharia  programação
5     Lívia     Engenharia        linux
6      João             RH    planilhas
7      João             RH        linux

In [91]:
pd.merge(df3,df4, on = 'Empregado')

  Empregado          Grupo  Data_contratação
0    Carlos  Contabilidade              2008
1      Luiz     Engenharia              2012
2     Lívia     Engenharia              2004
3      João             RH              2014

In [92]:
df8 = pd.DataFrame({'Nome':['Carlos','Luiz','Lívia','João'],
                   'Salário':[1500, 2000, 2500,1000]})
pd.merge(df3,df8, left_on='Empregado',right_on='Nome')

  Empregado          Grupo    Nome  Salário
0    Carlos  Contabilidade  Carlos     1500
1      Luiz     Engenharia    Luiz     2000
2     Lívia     Engenharia   Lívia     2500
3      João             RH    João     1000

In [93]:
#Excluding a redundant name:
pd.merge(df3,df8, left_on='Empregado',right_on='Nome').drop('Nome',axis=1)

  Empregado          Grupo  Salário
0    Carlos  Contabilidade     1500
1      Luiz     Engenharia     2000
2     Lívia     Engenharia     2500
3      João             RH     1000

In [94]:
#Creating a new data frame merging by the indices
df3a = df3.set_index('Empregado')
df4a = df4.set_index('Empregado')
pd.merge(df3a, df4a, left_index=True, right_index=True )

                   Grupo  Data_contratação
Empregado
Carlos     Contabilidade              2008
Luiz          Engenharia              2012
Lívia         Engenharia              2004
João                  RH              2014

In [95]:
df3a.join(df4a) #Not a panda operation, but works on indices as well

                   Grupo  Data_contratação
Empregado
Carlos     Contabilidade              2008
Luiz          Engenharia              2012
Lívia         Engenharia              2004
João                  RH              2014

In [96]:
pd.merge(df3a, df8, left_index=True, right_on='Nome')

           Grupo    Nome  Salário
0  Contabilidade  Carlos     1500
1     Engenharia    Luiz     2000
2     Engenharia   Lívia     2500
3             RH    João     1000

In [100]:
df9 = pd.DataFrame({'Nome': ['Marcelo', 'Paula', 'Maria'],
                    'Comida': ['Peixe', 'Feijão', 'Pão']},
                   columns=['Nome', 'Comida'])
df10 = pd.DataFrame({'Nome': ['Maria', 'José'],
                    'Bebida': ['Vinho', 'Cerveja']},
                   columns=['Nome', 'Bebida'])

pd.merge(df9, df10) 
#Inner value = maria, the only one merged on the function

    Nome Comida Bebida
0  Maria    Pão  Vinho

In [99]:
#outer values option inserts NaN on values you don't have
pd.merge(df9,df10, how='outer')

      Nome  Comida   Bebida
0  Marcelo   Peixe      NaN
1    Paula  Feijão      NaN
2    Maria     Pão    Vinho
3     José     NaN  Cerveja

In [101]:
#Returning values with referenced keys:
pd.merge(df9, df10, how='left')

      Nome  Comida Bebida
0  Marcelo   Peixe    NaN
1    Paula  Feijão    NaN
2    Maria     Pão  Vinho

In [103]:
pd.merge(df9,df10, how= 'right')

    Nome Comida   Bebida
0  Maria    Pão    Vinho
1   José    NaN  Cerveja